package lt.timofey;


//1. Реализовать алгоритм 2-замены для задачи коммивояжера
//2. Реализовать алгоритм "жадной раскраски"
//3. Реализовать алгоритм DSATUR
//
//Дополнительно: если расстояния между вершинами графа удовлетворяют неравенству треугольника, то найти путь алгоритмом Кристофидеса. Проверить, лучше ли он, чем алгоритм 2-замены.
//Чтобы сгенерировать случайный граф, можно воспользоваться одним из подходов, описанных, например, по ссылке.

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}